[
  {
    "id": 1,
    "title": "Guardians Of The Galaxy",
    "content": "Chris Pratt apparently stole his Star-Lord costume from the set, for the sole purpose of having it available so he could show up in costume to visit sick children in the hospital, who might want to meet Star-Lord.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b693f66ffa8__700.jpg"
  },
  {
    "id": 2,
    "title": "The Theory Of Everything",
    "content": "In an e-mail to director James Marsh about the portrayal by Eddie Redmayne, Stephen Hawking said there were certain points when he thought he was watching himself. In addition to his copyrighted voice, Stephen Hawking also lent the filmmakers his Companion of Honour medal and his signed thesis to use as genuine props in the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-109-5a560508045b3__700.jpg"
  },
  {
    "id": 3,
    "title": "Armageddon",
    "content": "NASA shows this film during their management training program. New managers are given the task of trying to spot as many errors as possible. At least one hundred sixty-eight have been found.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-99-5a560ed0840f8__700.jpg"
  },
  {
    "id": 4,
    "title": "Dallas Buyers Club",
    "content": "The film's budget was so low that the makeup budget was $250. The film's artists were able to work with that, and the film's Makeup and Hairstyling won an Oscar.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0ef96f59505__700.jpg"
  },
  {
    "id": 5,
    "title": "The Godfather",
    "content": "The cat held by Marlon Brando in the opening scene was a stray that Coppola found while on the lot at Paramount, and was not originally called for in the script. So content was the cat that its purring muffled some of Brando's dialogue, and, as a result, most of his lines had to be looped.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-102-5a55e6f68fc15__700.jpg"
  },
  {
    "id": 6,
    "title": "The Matrix",
    "content": "Kung Fu choreographer Woo-Ping Yuen initially refused to work on the film, and hoped that by asking for an exorbitant fee, it would turn off the Wachowskis. It didn't. He next formulated what he considered an impossible request. He said that he'd agree only if he had complete control of the fights, and that he trained the actors for four months before they shoot. The Wachowskis complied with his request.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a81e328254a__700.jpg"
  },
  {
    "id": 7,
    "title": "Elizabeth: The Golden Age",
    "content": "In the film, when Elizabeth arrives at St. Paul's Cathedral, construction is going on. In real life, St. Paul's actually needed repair work. Director Shekhar Kapur decided to improvise, and gave the workers costumes and period tools to cut real stone that was being installed in the cathedral. The workers in the scene are real-life stonemasons and construction workers.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a623691fc7__700.jpg"
  },
  {
    "id": 8,
    "title": "Django Unchained",
    "content": "When Calvin Candie (Leonardo DiCaprio) smashes his hand on the dinner table, DiCaprio accidentally crushed a small stemmed glass with his palm and really began to bleed. He ignored it, stayed in character, and continued with the scene. Quentin Tarantino was so impressed that he used this take in the final print, and when he called cut, the room erupted in a standing ovation.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7ca89d1abe__700.jpg"
  },
  {
    "id": 9,
    "title": "Forrest Gump",
    "content": "Tom Hanks was not paid for this film. Instead, he took percentage points which ultimately netted him in the region of forty million dollars.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59bbe693ce3aa__700.jpg"
  },
  {
    "id": 10,
    "title": "Titanic",
    "content": "After finding out that she had to be naked in front of Leonardo DiCaprio, Kate Winslet decided to break the ice, and when they first met, she flashed him.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-104-5a55e8e69d3c1__700.jpg"
  },
  {
    "id": 11,
    "title": "Schindler's List",
    "content": "To gather costumes for 20,000 extras, the costume designer took out advertisements seeking clothes. As economic conditions were poor in Poland, many people were eager to sell clothing they still owned from the 1930s and '40s.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-108-5a5600de938cd__700.jpg"
  },
  {
    "id": 12,
    "title": "The Chronicles Of Narnia: The Lion, The Witch And The Wardrobe",
    "content": "Georgie Henley's reaction to Mr. Tumnus at the lamppost is genuine. She had not seen her castmate James McAvoy in his costume before the scene was filmed, so her screams and reaction were real. Georgie's first reaction to the snowy world of Narnia is also genuine. She was carried into the set blindfolded to make her first entrance, and her wide-eyed, delighted reactions to it, all are entirely her own.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a6c3f12e83__700.jpg"
  },
  {
    "id": 13,
    "title": "The Dark Knight",
    "content": "In preparation for his role as The Joker, Heath Ledger hid away in a motel room for about six weeks. During this extended stay of seclusion, Ledger delved deep into the psychology of the character. He devoted himself to developing The Joker's every tic, namely the voice and that sadistic-sounding laugh.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/interesting-movie-facts-3-59a80cefbcafd__700.jpg"
  },
  {
    "id": 14,
    "title": "John Wick: Chapter 2",
    "content": "Keanu Reeves performed about 95 percent of the fight scenes himself. To prepare for the role, Keanu trained for three months. His training consisted of Judo, Brazilian Jiu-Jitsu, marksmanship, and driving.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a8164e0b949__700.jpg"
  },
  {
    "id": 15,
    "title": "The Lord Of The Rings: The Fellowship Of The Ring",
    "content": "The cast often had to fly to remote shoot locations by helicopter. Sean Bean (Boromir) was afraid of flying, and would only do it when absolutely necessary. When they were shooting the scenes of the Fellowship crossing the snowy mountains, he'd spend two hours every morning, climbing from the base of the mountain, to the set near the top, already dressed as Boromir. The crew being flown up, could see him from their helicopters.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/interesting-movie-facts-2-59a80cedbf51e__700.jpg"
  },
  {
    "id": 16,
    "title": "Pretty Woman",
    "content": "Edward (Richard Gere) snapping the necklace case down on Vivian's (Julia Roberts) fingers, was improvised by Gere, and Roberts's reaction (laughter) was totally natural. The filmmakers liked it so much, they decided to leave it in.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b78f13b88e2__700.jpg"
  },
  {
    "id": 17,
    "title": "Interstellar",
    "content": "For a cornfield scene, Christopher Nolan sought to grow five hundred acres of corn, which he learned was feasible from his producing of Man of Steel (2013). The corn was then sold, and actually made a profit.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-100-5a5469cf481f0__700.jpg"
  },
  {
    "id": 18,
    "title": "The Terminator",
    "content": "One afternoon during a break in filming, Arnold Schwarzenegger went into a restaurant in downtown L.A. to get some lunch and realized all too late that he was still in Terminator makeup - with a missing eye, exposed jawbone and burned flesh.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-41-5a55ec487744c__700.jpg"
  },
  {
    "id": 19,
    "title": "Star Trek",
    "content": "The sound of the automatic doors opening on the U.S.S. Enterprise, is a Russian train's toilet flushing.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a280bd6d4b56__700.jpg"
  },
  {
    "id": 20,
    "title": "The Revenant",
    "content": "Leonardo DiCaprio chose to devour a raw slab of bison's liver, even though he is vegetarian. He also had to learn to shoot a musket, build a fire, speak two Native American languages (Pawnee and Arikara), and study with a doctor who specializes in ancient healing techniques. DiCaprio calls it the hardest performance of his career.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b78c6d6da97__700.jpg"
  },
  {
    "id": 21,
    "title": "Jurassic Park",
    "content": "The sounds the Velociraptors make when communicating is the same sound tortoises make when having sex.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-42-5a5600189ca00__700.jpg"
  },
  {
    "id": 22,
    "title": "The Imitation Game",
    "content": "Benedict Cumberbatch confessed that in one of the final scenes of the film, he couldn't stop crying and had a breakdown. It was, as he said, \"Being an actor or a person that had grown incredibly fond of the character and thinking what he had suffered and how that had affected him.\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0db301f1f11__700.jpg"
  },
  {
    "id": 23,
    "title": "I Am Legend",
    "content": "Will Smith grew so enamored of his canine co-star, Abbey, that he tried to adopt her when filming was finished, but the dog's trainer could not be persuaded to give her up.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-84-5a560a773571c__700.jpg"
  },
  {
    "id": 24,
    "title": "Man Of Steel",
    "content": "Henry Cavill refused to take steroids to muscle up for the role. He also refused any digital touch-ups or enhancement to his body in his shirtless scenes. He said it would have been dishonest of him to use trickery while playing Superman, and he wanted to push his body to the limits, to develop his physique into one that was worthy of the character.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/10/Interesting-Movie-Facts-59d773d9075ab__700.jpg"
  },
  {
    "id": 25,
    "title": "Slumdog Millionaire",
    "content": "Director Danny Boyle placed the money to be paid to the 3 lead child actors in a trust that is to be released to them upon their completion of grade school at 16 years of age. The production company has set up for an auto-rikshaw driver to take the kids to school everyday until they are 16 years old.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a4505243ba__700.jpg"
  },
  {
    "id": 26,
    "title": "The Shawshank Redemption",
    "content": "When Andy goes to the library to begin work as Brooks' assistant and Brooks' crow, Jake, is squawking, Tim Robbins had to time his line, \"Hey, Jake. Where's Brooks?\" so that the crow wouldn't squawk over him, since the bird could not be trained to squawk on cue. Robbins was able to adapt to this and time his line perfectly by learning the bird's squawking patterns, for which Writer and Director Frank Darabont praised him. Robbins' improvisation is noticeable, as he watches the bird carefully while approaching it, waiting for it to squawk, and doesn't begin his line until after it does so.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59a95cbe6852a__700.jpg"
  },
  {
    "id": 27,
    "title": "The Martian",
    "content": "Matt Damon admitted that the scene where Mark was getting emotional upon hearing Commander Lewis' voice was genuine. The other actors had wrapped and gone home, and their pre-recorded voices were actually being played to Damon from inside his spacesuit. When Damon began to think about how his character had been all alone on Mars for two years, alongside how he was only hearing pre-recorded voices of his co-stars who had already finished their scenes, he began to tear up. Ridley Scott was so impressed with Damon's performance, that he only did one take of the scene, which was used in the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b78d3322b7a__700.jpg"
  },
  {
    "id": 28,
    "title": "Titanic",
    "content": "The scenes set in 1912, i.e. the whole movie except the present-day scenes and the opening and ending credits, have a total length of two hours and forty minutes, the exact time it took for Titanic to sink. Also, the collision with the iceberg reportedly lasted 37 seconds, which is how long the collision scene is in the movie.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-30-5a55e96b96cb1__700.jpg"
  },
  {
    "id": 29,
    "title": "I Am Legend",
    "content": "While doing a press conference in Japan for the release of the movie, Will Smith accidentally revealed the ending to a collection of entertainment reporters. Warner Bros. asked the reporters and all those present to withhold the ending, and the reporters all obliged without any pay-off or consideration.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-111-5a560baa697f5__700.jpg"
  },
  {
    "id": 30,
    "title": "Saving Private Ryan",
    "content": "Tom Sizemore was battling a drug addiction during production. Steven Spielberg gave him an ultimatum that he would be blood tested on the set every day of filming, and if he failed the test once he would be fired and the part of Horvath would be recast and re-shot with someone else, even if it was at the end of production.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a80fb909ca1__700.jpg"
  },
  {
    "id": 31,
    "title": "Wonder Woman",
    "content": "Gal Gadot was a part of re-shoots for the movie (including stunts) while being five months pregnant. Her baby bump was visible, so the crew created a costume which had a green screen around her belly, which was later removed during post-production.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7ccdf750d9__700.jpg"
  },
  {
    "id": 32,
    "title": "Into The Woods",
    "content": "At a Q&A session after screening of the film, James Corden recalled an incident during rehearsals in which Meryl Streep jumped on a table and her foot got caught in her costume. She started falling backwards, head first, toward a concrete floor. Both Corden and director Rob Marshall froze in the fear that they were about to witness the death of Meryl Streep. However, a pregnant Emily Blunt stepped in and caught Streep before she hit the floor.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0ef3eee59d2__700.jpg"
  },
  {
    "id": 33,
    "title": "Maleficent",
    "content": "Angelina Jolie admitted that she scared little kids while in costume on the set of Maleficent, with one kid actually saying, \"Mommy, please get the mean witch to stop talking to me.\" She adds that her daughter, Vivienne Jolie-Pitt, who played young Aurora, was the only child who was not scared of her.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0db231840be__700.jpg"
  },
  {
    "id": 34,
    "title": "The Theory Of Everything",
    "content": "Eddie Redmayne met with Stephen Hawking only once before filming. \"In the three hours I spent with him, he said maybe eight sentences,\" recalls Redmayne. \"I just didn't feel like I could ask him intimate things.\" Therefore, he found other ways to prepare for the role. He lost about 15 pounds and trained for four months with a dancer to learn how to control his body. He met with 40 ALS patients, kept a chart tracking the order in which Hawking's muscles declined, and stood in front of a mirror for hours on end, contorting his face. Lastly, he remained motionless and hunched over between takes, so much so that an osteopath told him he had altered the alignment of his spine. \"I fear I'm a bit of a control freak,\" Redmayne admits. \"I was obsessive. I'm not sure it was healthy.\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-62-5a56040ea3c43__700.jpg"
  },
  {
    "id": 35,
    "title": "The Devil Wears Prada",
    "content": "On the first day of filming, Meryl Streep told Anne Hathaway, \"I think you're perfect for the role. I'm so happy we're going to be working together.\" Then she paused and followed it up with, \"That's the last nice thing I'll say to you.\" And it was.Many fashion designers allowed their clothes and accessories to be used in the film, making it the most expensively-costumed film in history. Meryl Streep donated her wardrobe to a charity auction.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a64d90b120__700.jpg"
  },
  {
    "id": 36,
    "title": "Fantastic Beasts And Where To Find Them",
    "content": "Wand school was obligatory for several of the cast members. The actors and actresses would attend a boot camp, in order to be instructed how to move and use a wand properly.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59aea9631b2a6__700.jpg"
  },
  {
    "id": 37,
    "title": "Rocky IV",
    "content": "Sylvester Stallone wanted to make sure the boxing scenes looked real in Rocky IV, so he instructed Dolph Lundgren to actually hit him. A punch to the chest left Stallone in intensive care for four days.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b78fdae9f64__700.jpg"
  },
  {
    "id": 38,
    "title": "Black Swan",
    "content": "Natalie Portman not only trained for a year as a dancer to prepare for the role, but paid for the the training out of her own pocket until the film found investors. Aronofsky attributed the film's getting made at all to Portman's dedication and enthusiasm.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a20142b02e36__700.jpg"
  },
  {
    "id": 39,
    "title": "Fight Club",
    "content": "Brad Pitt and Edward Norton both really learned how to make soap.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59a976bc6c65c__700.jpg"
  },
  {
    "id": 40,
    "title": "Cast Away",
    "content": "To make himself look like an average out of shape middle aged man Tom Hanks didn't exercise and allowed himself to grow pudgy. Production was then halted for a year so he could lose fifty pounds and grow out his hair for his time spent on the deserted island.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/interesting-movie-facts-1-59a80cebba20b__700.jpg"
  },
  {
    "id": 41,
    "title": "The Mummy",
    "content": "Brendan Fraser nearly died during a scene where his character is hanged. Rachel Weisz remembered, \"He stopped breathing and had to be resuscitated.\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a439cb9bd977__700.jpg"
  },
  {
    "id": 42,
    "title": "The Terminator",
    "content": "Arnold Schwarzenegger worked with guns every day for a month to prepare for the role. The first two weeks of filming he practiced weapons stripping and reassembly blindfolded until the motions were automatic, like a machine. He spent hours at the shooting range and practicing with different weapons without blinking or looking at them when reloading or cocking. He also had to be ambidextrous.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-106-5a55ee2a509d8__700.jpg"
  },
  {
    "id": 43,
    "title": "Get Out",
    "content": "Daniel Kaluuya was given the lead role on the spot after nailing his audition. Jordan Peele said Kaluuya did about five takes of a key scene, in which his character needs to cry, and each was so perfect that the single tear came down at the exact same time for each take.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-116-5a5630e92fda9__700.jpg"
  },
  {
    "id": 44,
    "title": "12 Years A Slave",
    "content": "In order to better portray an alcoholic, Michael Fassbender had his makeup artist paint his mustache with alcohol so that the other actors would react naturally to the smell, as they would to a man who had been drinking heavily.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a81f2048693__700.jpg"
  },
  {
    "id": 45,
    "title": "Candyman",
    "content": "The bees were bred specifically for this movie. They needed to make sure that the bees were only twelve hours old, so that they looked like mature bees, but their stinger wouldn't be powerful enough to do any real damage.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7d7b5af3e9__700.jpg"
  },
  {
    "id": 46,
    "title": "Iron Man",
    "content": "Paul Bettany has never seen the film, and is unfamiliar with the plot. He said J.A.R.V.I.S. was the easiest job ever, and it was almost like a robbery, since he only worked for two hours, got paid a lot of money, then went on vacation with his wife (Jennifer Connelly).",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59afbaac160ce__700.jpg"
  },
  {
    "id": 47,
    "title": "Kingsman: The Secret Service",
    "content": "In the film and trailer, when the new Kingsman recruits have their first night's sleep interrupted by a deluge of water pouring into the dorm, on-set the scene went horrifically wrong. As Matthew Vaughn recalls \"I shouted 'action!', the computer got it wrong and vrrrrssshh, everyone was twenty feet down underwater. Cameras, sound guys... Guys were in waders full of water, panic, everyone diving in and pulling people out.\" The set, painstakingly planned and rehearsed using height markers and computer-programmed water tanks, washed away in a near-biblical flood when said computers went rogue. \"Those actors weren't acting, they were absolutely terrified,\" shudders Vaughn. \"It was awful for the first day of filming.\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0daaee78553__700.jpg"
  },
  {
    "id": 48,
    "title": "Logan",
    "content": "Sir Patrick Stewart lost 21 pounds to play Charles Xavier as elderly and sick. Stewart claimed that he had a steady weight since he was a teenager and had never deliberately lost weight before.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a81a8ec7586__700.jpg"
  },
  {
    "id": 49,
    "title": "The Godfather",
    "content": "During an early shot of the scene where Vito Corleone returns home and his people carry him up the stairs, Marlon Brando put weights under his body on the bed as a prank, to make it harder to lift him.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-103-5a55e7eea06ef__700.jpg"
  },
  {
    "id": 50,
    "title": "Prometheus",
    "content": "Composer Marc Streitenfeld had the orchestra play his compositions backwards, and then digitally reversed the compositions for the final film. This made the music sound unusual and unsettling, which he felt was right for the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a12ecd13aace__700.jpg"
  },
  {
    "id": 51,
    "title": "Captain America: The First Avenger",
    "content": "Hayley Atwell surprisingly touching Chris Evans' chest, as he emerged from the pod upon turning into Captain America, was very much improvised, and the surprise on her face is genuine, as she admitted in interviews she was very taken by Chris' physique and nearly broke character and ruined the take that made it into the film, as a result.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a15873885481__700.jpg"
  },
  {
    "id": 52,
    "title": "Bridget Jones's Diary",
    "content": "To prepare for the role, Renée Zellweger gained 25 pounds, and then actually worked at a British publishing company for a month in preparation for the role. She adopted an alias as well as her posh accent and was apparently not recognized. On her desk in this office she kept a framed picture of then boyfriend Jim Carrey. Workers who did not recognize her found this to be odd, but never mentioned it to her for fear of embarrassing her.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a3291fd199f3__700.jpg"
  },
  {
    "id": 53,
    "title": "Schindler's List",
    "content": "During production, the atmosphere was so grim and depressing that Steven Spielberg asked his friend Robin Williams if he could tell some jokes and do comedy sketches while Spielberg would watch episodes of Seinfeld (1989). Some of Williams' sketches, while played through the speaker phone to the cast and crew, ended up being part of dialogue material for his character in Aladdin (1992), the Genie.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-44-5a5600fdc909e__700.jpg"
  },
  {
    "id": 54,
    "title": "The Hangover",
    "content": "In The Hangover, Ed Helms is actually missing a tooth. He never had an adult incisor grow, and his fake incisor was taken out for the parts of filming where Stu's tooth is missing.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7d4f086057__700.jpg"
  },
  {
    "id": 55,
    "title": "It",
    "content": "The Duffer Brothers originally wanted to direct the movie, but were overlooked as they were not \"established\" enough. They went on to create Stranger Things (2016), which co-stars Finn Wolfhard (Richie) and pays homage to Stephen King. ",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-115-5a562e98b835b__700.jpg"
  },
  {
    "id": 56,
    "title": "The Maze Runner",
    "content": "The production had to hire snake wranglers to make sure the areas where they were filming were snake free. Before filming began the wranglers found 25 venomous snakes. The biggest one they found was a 5 foot rattlesnake.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/10/Interesting-Movie-Facts-59d772519199a__700.jpg"
  },
  {
    "id": 57,
    "title": "2001: A Space Odyssey",
    "content": "Stanley Kubrick destroyed almost all of his props and sets from 2001: A Space Odyssey because he didn't want them to be used in any lesser science fiction films.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b79105286b7__700.jpg"
  },
  {
    "id": 58,
    "title": "Inglourious Basterds",
    "content": "When asked how he got into the violent, baseball bat-wielding mindset of \"The Bear Jew\", Eli Roth partially attributed his performance to the historically accurate costumes: \"Being in wool underwear will make you want to kill anything.\" He also stated (in a separate interview) that his girlfriend had secretly added some Hannah Montana (2006) music onto his iPod; when he listened to it, it inexplicably made him able to tap into the violent nature of The Bear Jew.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a27f89a61e7e__700.jpg"
  },
  {
    "id": 59,
    "title": "The Terminator",
    "content": "O.J. Simpson was considered for the Terminator, but the producers feared he was \"too nice\" to be taken seriously as a cold-blooded killer.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-107-5a55ee96b0fd4__700.jpg"
  },
  {
    "id": 60,
    "title": "What We Do In The Shadows",
    "content": "The man who plays Stu is not an actor but actually Stu Rutherford. A part-time business analyst for a Wellington company, LanWorx. He was hired for the film under the impression that he would be working on computers, and that he would play a small part in the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0da9c1c71ee__700.jpg"
  },
  {
    "id": 61,
    "title": "The Social Network",
    "content": "During one of the depositions, it is mentioned that the invention of Facebook made Mark Zuckerberg \"the biggest thing on a campus that included nineteen Nobel Laureates, fifteen Pulitzer Prize winners, two future Olympians, and a movie star.\" One of the lawyers then asks, \"Who was the movie star?\" and the response is, \"Does it matter?\" This movie star was, in fact, Natalie Portman, who was enrolled at Harvard from 1999 to 2003 and helped screenwriter Aaron Sorkin by providing him insider information about goings-on at Harvard at the time Facebook first appeared there.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a2016ca7435c__700.jpg"
  },
  {
    "id": 62,
    "title": "The Phantom Of The Opera",
    "content": "The doll in the Phantom's lair that is supposed to resemble Emmy Rossum is not actually a wax mold. It is Emmy Rossum. The production produced a mask of her face to use on the mannequin but when they put in the fake eyes it didn't look like her. She suggested to stand in as the mannequin instead. This was done by her being made up like a doll with waxy makeup on, and her standing very, very still.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a8fbe5df46__700.jpg"
  },
  {
    "id": 63,
    "title": "The Wolf Of Wall Street",
    "content": "The actors snorted crushed B vitamins for scenes that involved cocaine. Jonah Hill claimed that he eventually became sick with bronchitis after so much inhaling and had to be hospitalized.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a824fea4adb__700.jpg"
  },
  {
    "id": 64,
    "title": "Avatar",
    "content": "James Cameron was convinced that CGI effects had progressed enough to make this film when he saw Gollum in The Lord of the Rings: The Two Towers (2002).",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-110-5a560606567c0__700.jpg"
  },
  {
    "id": 65,
    "title": "The Amazing Spider-Man",
    "content": "When first wearing the Spider-Man costume Andrew Garfield admitted to shedding tears.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a1585d089410__700.jpg"
  },
  {
    "id": 66,
    "title": "King Arthur: Legend Of The Sword",
    "content": "Charlie Hunnam had lost 20 pounds for the last season of Sons of Anarchy (2008). During auditions, director Guy Ritchie was very bothered by his look, though he liked his performance, and asked him four times during the process about his poor physique. Hunnam said that when Ritchie brought up the fourth time, he told Ritchie, \"Look, dude, you keep bringing this up, the physicality. It's obviously your primary concern. So if you want to do away with all this auditioning bollocks, I'll fucking fight those other two dudes. I know who they are. You can bring them both in here. I'll fight them both. The one who walks out the door gets the job.\" Hunnam won the role.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-118-5a56355889220__700.jpg"
  },
  {
    "id": 67,
    "title": "Now You See Me",
    "content": "Isla Fisher got into difficulty while filming the piranha tank scene. The top of the tank remained opened so that Fisher would be able to swim to the top to get some air, and there was also an emergency lever inside the tank that, if pulled, would alert the crew that she needed help. During one take, Fisher was running out of air, and tried to swim to the top, but the chains on the handcuffs she was wearing got stuck on the bottom of the tank, so she was unable to swim to the top, or pull the lever. She then attempted to alert the crew by hitting the glass of the tank, but since her character is supposed to be panicked and scared in the scene, the crew thought she was acting. She was stuck for three minutes, before the Stunt Coordinator finally realized that something was wrong, after he noticed that her handcuffs were stuck.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/10/Interesting-Movie-Facts-59d7760c454c2__700.jpg"
  },
  {
    "id": 68,
    "title": "The Hunger Games",
    "content": "On the set of the Hunger Games, Jennifer Lawrence told co-star Josh Hutcherson she could kick all the way over his head. Instead, she gave him a concussion.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-40-5a55e9ce732a8__700.jpg"
  },
  {
    "id": 69,
    "title": "The Pianist",
    "content": "In order to connect with the feeling of loss required to play the role, Adrien Brody got rid of his apartment, sold his car, and didn't watch television.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59afc2e932694__700.jpg"
  },
  {
    "id": 70,
    "title": "Casino Royale",
    "content": "Daniel Craig lost the two front teeth while filming a fight scene in Prague (the first action scene to be shot), and his dentist had to fly from London to replace them.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7e877c270c__700.jpg"
  },
  {
    "id": 71,
    "title": "Amélie",
    "content": "Audrey Tautou doesn't know how to skip stones; the stone-skipping scenes were made with special effects.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a328ed5f037e__700.jpg"
  },
  {
    "id": 72,
    "title": "Batman Returns",
    "content": "Michelle Pfeiffer said that her Catwoman costume was vacuum sealed once she was fitted into it for scenes, so she actually had only a short amount of time to perform before she would have to have it opened or she could become light headed and pass out.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b791a4935d6__700.jpg"
  },
  {
    "id": 73,
    "title": "Halloween",
    "content": "The Michael Myers face mask in Halloween is just a Captain Kirk/William Shatner face mask. They spray-painted the face white, teased out the hair, and reshaped the eye holes.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7cb16181a7__700.jpg"
  },
  {
    "id": 74,
    "title": "A Clockwork Orange",
    "content": "During the filming of the Ludovico scene, star Malcolm McDowell scratched one of his corneas and was temporarily blinded. He suffered cracked ribs during filming of the humiliation stage show.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7d6d001804__700.jpg"
  },
  {
    "id": 75,
    "title": "Charlie And The Chocolate Factory",
    "content": "Nestlé provided 1,850 bars of real chocolate.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a6ced4b141__700.jpg"
  },
  {
    "id": 76,
    "title": "Napoleon Dynamite",
    "content": "Jon Heder was paid $1,000 to play Napoleon Dynamite. The movie grossed over $40,000,000 in the United States.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a9213cd7c9__700.jpg"
  },
  {
    "id": 77,
    "title": "Blade Runner 2049",
    "content": "A visual effects company worked for a full year on the scene where Rachael (Sean Young) appears exactly as she did 35 years ago in Blade Runner (1982). Stand-in actress Loren Peta acted out the scene, and her appearance was changed through computer-generated visual effects to resemble Young. ",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-114-5a561afe552c3__700.jpg"
  },
  {
    "id": 78,
    "title": "Drive",
    "content": "In preparation for his role, Ryan Gosling restored the 1973 Chevy Malibu that his character uses in the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a15868e934de__700.jpg"
  },
  {
    "id": 79,
    "title": "Avatar",
    "content": "Director James Cameron, known for being tough on set, allegedly kept a nail-gun on set that he would use to nail cell phones, that had the misfortune of ringing, to a wall above the exit sign.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-78-5a5605e334f0b__700.jpg"
  },
  {
    "id": 80,
    "title": "The Notebook",
    "content": "According to Nick Cassavetes, Ryan Gosling and Rachel McAdams did not get along at first and Gosling tried to have McAdams replaced. To improve the relationship between the leads, director Nick Cassavetes staged an intervention by bringing them into a room where they could air all the grievances they had with each other and work something out. They soon patched over their differences, enough to become a real-life couple for some time.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a8586d67a0__700.jpg"
  },
  {
    "id": 81,
    "title": "Moulin Rouge!",
    "content": "The necklace worn by Nicole Kidman was made of real diamonds and platinum and was the most expensive piece of jewelry ever specifically made for a film. The Stefano Canturi necklace was made with 1,308 diamonds, weighing a total of 134 carats and was worth an estimated U.S. $1 million.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-112-5a560e3bb0a16__700.jpg"
  },
  {
    "id": 82,
    "title": "American Hustle",
    "content": "According to Christian Bale much of the movie was improvised. So, during the shooting of the film he noted to David O. Russell, \"You realize that this is going to change the plot greatly down track.\" To which the director replied, \"Christian, I hate plots. I am all about characters, that's it.\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/10/Interesting-Movie-Facts-59d78018ab13d__700.jpg"
  },
  {
    "id": 83,
    "title": "Les Misérables",
    "content": "Hugh Jackman lost considerable weight and went 36 hours without water, causing him to lose water weight around his eyes and cheeks, giving him the gaunt appearance of a prisoner. He also grew a real scraggly beard for scenes of Valjean as a prisoner, though mercifully they were shot first in production and he could shave and return to his usual weight for scenes playing Valjean as a wealthy man. '",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a12eab636613__700.jpg"
  },
  {
    "id": 84,
    "title": "Poltergeist",
    "content": "During the scene where Robbie (Oliver Robins) is being strangled, the clown's arms became extremely tight and Robins started to choke. When he screamed out, \"I can't breathe!\" Steven Spielberg and Tobe Hooper thought that the boy was ad-libbing and just instructed him to look at the camera. When Spielberg saw Robbins's face turning purple, he ran over and removed the clown's arms from Robbins's neck.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7d1db79dad__700.jpg"
  },
  {
    "id": 85,
    "title": "The Fault In Our Stars",
    "content": "Shailene Woodley cut her waist-long hair, which she needs for her role as Tris in Insurgent, to a pageboy haircut and was not able to wear a wig. She donated the hair to a local childrens hospital that makes wigs for the kids.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0ee59d35366__700.jpg"
  },
  {
    "id": 86,
    "title": "Birdman Or (The Unexpected Virtue Of Ignorance)",
    "content": "Given the unusual style of filming long takes, Edward Norton and Michael Keaton kept a running tally of flubs made by the actors and actresses. Emma Stone made the most mistakes. Zach Galifianakis made the fewest. He actually did mess up a few lines during the filming, but played his mistakes off well enough, that the shots were included in the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-121-5a6b3fc46a5e1__700.jpg"
  },
  {
    "id": 87,
    "title": "Interview With The Vampire: The Vampire Chronicles",
    "content": "All the actors playing vampires were required to hang upside down for up to thirty minutes at a time during the make-up application. This would force all the blood in their bodies to rush to their heads, causing the blood vessels in their faces to bulge out. The make up artists would then trace over the swollen veins creating the eerie translucent-skinned vampire look. Unfortunately for the actors, they would have to repeat the process several times over, as the blood would quickly drain from their heads. This, in part, accounts for the lengthy make-up process.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59a96d871659e__700.jpg"
  },
  {
    "id": 88,
    "title": "Gone Girl",
    "content": "Production of the film had to be shut down for four days, due to Ben Affleck's refusal to follow David Fincher's vision, and wear a New York Yankees cap for a scene where Affleck's character, Nick, is at an airport. The Bostonian actor said to Fincher, \"David, I love you, I would do anything for you. But I will not wear a Yankees hat.\" Eventually, the two settled for Ben's character to wear a Mets cap. Fincher jokingly describes Affleck's actions of this as \"entirely unprofessional\" in the DVD's audio commentary.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/10/Interesting-Movie-Facts-59d76e2325448__700.jpg"
  },
  {
    "id": 89,
    "title": "Moulin Rouge!",
    "content": "Filming was halted for two weeks in November 1999 after Nicole Kidman fractured two ribs and injured her knee while rehearsing a dance routine for the film. Many of the scenes where she is seen only from the chest up, including \"a real actress,\" were shot while she was in a wheelchair.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-95-5a560d64ccf4b__700.jpg"
  },
  {
    "id": 90,
    "title": "Inception",
    "content": "In an interview with 'Entertainment Weekly', Christopher Nolan explained that he based roles of the Inception team similar to roles that are used in filmmaking - Cobb is the Director, Arthur is the Producer, Ariadne is the Production Designer, Eames is the Actor, Saito is the Studio, and Fischer is the Audience. \"In trying to write a team-based creative process, I wrote the one I know,\" said Nolan.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59afdbe7e0695__700.jpg"
  },
  {
    "id": 91,
    "title": "The Grand Budapest Hotel",
    "content": "Tilda Swinton spent five hours in the makeup chair to play 84-year-old dowager Madame D. \"We're not usually working with a vast, Bruckheimer-type budget on my films, so often we're trying a work-around,\" said Wes Anderson. \"But for the old-age makeup I just said, 'Let's get the most expensive people we can'.\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0daf66d213d__700.jpg"
  },
  {
    "id": 92,
    "title": "Lara Croft: Tomb Raider",
    "content": "Filming the scenes where Lara drives her Land Rover through the jungle there had to be endless re-shoots due to snakes and other wildlife falling through the open top roof. Angelina Jolie herself was reported to be terrified.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a32948f92cad__700.jpg"
  },
  {
    "id": 93,
    "title": "Pulp Fiction",
    "content": "The shot of Vincent plunging the syringe into Mia's chest was filmed by having John Travolta pull the needle out, then running the film backwards.Watch carefully and you'll see a mark on Mia's chest disappear when she's revived (YouTube).",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59bbe08ebc19a__700.jpg"
  },
  {
    "id": 94,
    "title": "Perfume: The Story Of A Murderer",
    "content": "The Fish Market scenes were shot in Barcelona's Gothic Quarter. Two and a half tons of fish and one ton of meat was used over the course of the shoot, and people as far away as six miles, reported a bad smell in the air.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-87-5a560cf1f3ebc__700.jpg"
  },
  {
    "id": 95,
    "title": "Star Wars: The Last Jedi",
    "content": "After first completing the arduous 600-foot climb on Ireland's Skellig Michael island, Mark Hamill had hoped that he could avoid having to repeat the trek for additional scenes if he could somehow remain on the summit overnight, thus forfeiting the luxury of room service at his hotel. He suggested sleeping in a tent and 'staying in character.' However, after some inquiries were made with the Irish authorities, he was told by producer Kathleen Kennedy that he was not permitted to pitch a tent because the location is a protected UNESCO World Heritage Site.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-113-5a56159355f21__700.jpg"
  },
  {
    "id": 96,
    "title": "Zero Dark Thirty",
    "content": "James Gandolfini sent a note to Leon Panetta before the film came out, writing, \"I'm very sorry about everything. I apologize. You're like my father, so you'll find something to be angry about, but please let me know.\" Months later, as the film was in the middle of awards season in early January, screenwriter Mark Boal told Gandolfini, \"Leon Panetta would like your phone number because he doesn't know how to get in touch with you.\" The actor replied \"He's the head of the CIA! He can't find me? Come on, really?!\"",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-124-5a6b44c778c17__700.jpg"
  },
  {
    "id": 97,
    "title": "The Departed",
    "content": "Jack Nicholson pulled a real gun on Leo DiCaprio in The Departed, even though it wasn't in the script. He thought the scene wasn't intense enough before.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7d9ddb1b56__700.jpg"
  },
  {
    "id": 98,
    "title": "Sunshine",
    "content": "Cillian Murphy worked with leading physicist Brian Cox to learn all about advanced physics. This included touring the CERN facility in Switzerland and learned to copy physicists' mannerisms. Murphy ended up copying some of Cox's personal idiosyncrasies, such as his frequent hand movements. The actor also studied Henri-Georges Clouzot's classic The Wages of Fear (1953) to have an understanding of the type of suspense that Danny Boyle was attempting to create. Murphy has claimed that his involvement in Sunshine converted him from agnosticism to atheism.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a5fd332d6c__700.jpg"
  },
  {
    "id": 99,
    "title": "Nightcrawler",
    "content": "During the scene where Jake Gyllenhaal screams at himself in the mirror, Gyllenhaal got so into the scene that the mirror cracked, cutting his hand. He had to go to the hospital for 14 stitches, returning to the set after being discharged.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-122-5a6b41c723a11__700.jpg"
  },
  {
    "id": 100,
    "title": "Into The Wild",
    "content": "The temperature outdoors was at freezing when Emile Hirsch performed the naked back float down the stream.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-101-5a55e25c78ce6__700.jpg"
  },
  {
    "id": 101,
    "title": "The Passion Of The Christ",
    "content": "Jim Caviezel admitted he was struck by lightning while filming the Sermon on the Mount and during the crucifixion.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59b7c89c73bff__700.jpg"
  },
  {
    "id": 102,
    "title": "Snow White And The Huntsman",
    "content": "The drops of blood at the beginning of the film are drops of real blood from director Rupert Sanders. Sanders felt the fake blood looked too unrealistic, so he pricked his finger to get the shot he wanted.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-69-5a56058f832b6__700.jpg"
  },
  {
    "id": 103,
    "title": "Pirates Of The Caribbean: Dead Men Tell No Tales",
    "content": "The film was being produced as Johnny Depp was going through a bitter divorce from his wife Amber Heard. He was chronically late to the set, to the point where it ate into the schedule as the set often came to a halt for hours at a time. It got to the point where a production assistant was hired just to wait outside Depp's house and announce that he was awake when they saw the lights inside come on.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-119-5a56363414416__700.jpg"
  },
  {
    "id": 104,
    "title": "My Left Foot",
    "content": "Daniel Day-Lewis broke two ribs during filming from assuming the hunched-over position in his wheelchair for weeks of filming. He also would refuse to come out of character. On visits to the set canteen, other people would have to help him with food.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a812c3b886d__700.jpg"
  },
  {
    "id": 105,
    "title": "Cloud Atlas",
    "content": "While on the set of this movie, Tom Hanks started calling Lana Wachowski and Lilly Wachowski, \"Mom and Dad,\" because they worked so well together and as leaders of the cast and crew.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a12efacef4a1__700.jpg"
  },
  {
    "id": 106,
    "title": "Anna Karenina",
    "content": "One of Alicia Vikander's favorite experiences from the production was the filming that took place in the countryside outside of St. Petersburg, Russia. The temperatures soared below -40 °C, and she stayed in a cabin for five days that didn't have hot water and only featured benches instead of beds. Meanwhile, Russian security guards protected her and co-star Domhnall Gleeson from wild wolves and bears that dominated the deserted area",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a13f97793955__700.jpg"
  },
  {
    "id": 107,
    "title": "The Great Gatsby",
    "content": "According to Tom Breen, the owner of property \"Breenhold\" in the Blue Mountains where a lot of filming took place, there was a huge stuff-up on set by a \"private weather guru\" who was hired by Baz Luhrmann. Mr Breen claims that on a beautiful spring day, the crew purchased 100,000 litres of water from one of the dams to create the synthetic rain needed for the scene where a nervous Gatsby has Nick Carroway invite Daisy over for tea. It rained for the next 3 days.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59afc07628d0a__700.jpg"
  },
  {
    "id": 108,
    "title": "Million Dollar Baby",
    "content": "Hilary Swank contracted a bacterial infection from a blister she developed on her foot during training for her role. The infection was so serious that she almost had to be hospitalized for three weeks. Catching the infection in the nick of time, she instead chose to take a week off for medicated rest and didn't tell Clint Eastwood or the other producers of the film about the injury, because she didn't believe it was in character.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/08/Interesting-Movie-Facts-59a8152379d51__700.jpg"
  },
  {
    "id": 109,
    "title": "Boyhood",
    "content": "Richard Linklater cast his daughter Lorelei Linklater as Samantha because she was always singing and dancing around the house and wanted to be in his movies. At about the third or fourth year of filming, she lost interest and asked for her character to be killed off. Linklater refused, saying it was too violent for what he was planning (Lorelei eventually regained her enthusiasm and continued with the project).",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-120-5a6b3f2500fa3__700.jpg"
  },
  {
    "id": 110,
    "title": "Ex Machina",
    "content": "Throughout the film, the colors red, blue, and green are prominently displayed in each scene (the green forest, the red brick hallway, the keypad's red and blue functions, etc.) This is a nod to the RGB color model, which is used to display images in electronic systems, such as computers. Ava, of course, being the main computer in the film.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0dad82e97bb__700.jpg"
  },
  {
    "id": 111,
    "title": "The Cabin In The Woods",
    "content": "When Jules kisses the wolf head on the wall, the wolf's tongue is covered in powdered sugar to give it a dusty look and to make the scene tolerable for Anna Hutchison.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a12ede4d7098__700.jpg"
  },
  {
    "id": 112,
    "title": "Valkyrie",
    "content": "Germany has strict laws against displaying the swastika, though artistic displays are specifically exempt. Filmmakers usually use incorrect swastikas to avoid causing public outrage. The producer wanted swastikas for authenticity, so the crew posted warnings around the filming locations. Still, a local resident filed an official complaint with the city, who pressed charges against the owners of some filming sites.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/12/Interesting-Movie-Facts-5a2a4da22cc8e__700.jpg"
  },
  {
    "id": 113,
    "title": "Only Lovers Left Alive",
    "content": "All of the cast members playing vampires wore wigs that were a mix of human, yak, and goat hair, in order to make them look wilder.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-123-5a6b42f91c90c__700.jpg"
  },
  {
    "id": 114,
    "title": "Melancholia",
    "content": "During the Cannes Film Festival press conference for the film, Lars von Trier responded to a question about the use of Wagner's music, by calling himself a Nazi, and saying that he sympathized with Hitler. Despite apologizing for his remarks, he was banned from the remainder of the festival, and declared a persona non grata by festival organizers, a first in the history of the festival.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-125-5a6b45a22f87d__700.jpg"
  },
  {
    "id": 115,
    "title": "Mother!",
    "content": "Jennifer Lawrence got so much into her character that during the climactic scenes, she started hyperventilating and even cracked a rib. After filming the scene in which Jennifer Lawrence hyperventilated (and production was put on hold while she was placed on oxygen), members of the crew came up with the idea to make Lawrence her very own \"happy place\"--a tent complete with gumballs and clips of \"Keeping Up with the Kardashians\" that play on a constant loop.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2018/01/interesting-movie-facts-117-5a56321f2093a__700.jpg"
  },
  {
    "id": 116,
    "title": "300: Rise Of An Empire",
    "content": "Though a large part of the film takes place on water and boats, the film was filmed completely \"dry\" with all the water digitally added in later.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a0da93235501__700.jpg"
  },
  {
    "id": 117,
    "title": "Twilight",
    "content": "For the role of Edward Cullen, Robert Pattinson flew from England to director Catherine Hardwicke's house to audition. There, he and Kristen Stewart, who was already cast as Bella Swan, rehearsed the \"Love Scene\"/\"Meadow Scene\" on Hardwicke's own bed.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/09/Interesting-Movie-Facts-59afb6d118283__700.jpg"
  },
  {
    "id": 118,
    "title": "Spring Breakers",
    "content": "Selena Gomez didn't know how to smoke and had never done it before. So they had to teach her for the movie.",
    "image": "https://static.boredpanda.com/blog/wp-content/uploads/2017/11/Interesting-Movie-Facts-5a12f818d3d9f__700.jpg"
  }
]
